package com.gcfd.common;
/**
* @类名：EnumNetCode.java
* @作者：one
* @时间：2016年6月20日 下午5:53:24
* @版权：pengkaione@icloud.com
* @描述： 
*/
public enum EnumNetCode {
		/**
		 * EEEEE 网络异常
		 */
		 EEEEE,
		/**
		 * C1000 请求成功
		 */
		 C1000,
		 /**
		  * C2002 请求接口无效
		 */
		 C2002,
		 /**
		  * C2003 请求接口异常
		  */
		 C2003,
		 /**
		  * C3001 接口授权过期
		  */
		 C3001,
		 /**
		  * C3002 非法访问
		  */
		 C3002 ,
		 /**
		  * C9001 请求参数类型错误,请按要求输入参数
		  */
		 C9001 ,
		 /**
		  * 用户不存在
		  */
		 U1000,
		 /**
		  * 密码错误
		  */
		 U1001,
		 /**
		  * 用户过期
		  */
		 U1002,
		 /**
		  * 用户已锁定，请联系客服
		  */
		 U1003,
		 /**
		  * 用户已注销
		  */
		 U1004,
		 /**
		  * 文件上传成功
		  */
		 F1000,
		 /**
		  * 文件上传失败
		  */
		 F1001,
		 /**
		  * 插入成功
		  */
		 I1000,
		 /**
		  * 插入失败
		  */
		 I1002,
		 /**
		  * 更新成功
		  */
		 UP1001,
		 /**
		  * 更新失败
		  */
		 UP1002,
		 /**
		  * 删除成功
		  */
		 D1001,
		 /**
		  * 删除失败
		  */
		 D1002,
		 /**
		  * 注销成功 
		  */
		 Z1001,
		 /**
		  * 注销失败
		  */
		 Z1002,
		 /**
		  * 查询成功
		  */
		 Q1001,
		 /**
		  * 查询失败
		  */
		 Q1002
		 ;
}
